In [1]:
import pandas as pd

In [2]:
dados = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
df = pd.DataFrame(dados,
                 index=['lin1', 'lin2', 'lin3'],
                 columns=['col1', 'col2', 'col3'])
df

      col1  col2  col3
lin1     1     2     3
lin2     4     5     6
lin3     7     8     9

In [4]:
#Selecionando o valor 5
df['col2']['lin2']

5

In [5]:
#Selecionando o valor 5 com at
df.at['lin2', 'col2']

5

In [6]:
#Alterando valor do dataframe
df.at['lin2', 'col2'] = 6
df

      col1  col2  col3
lin1     1     2     3
lin2     4     6     6
lin3     7     8     9

In [16]:
#Função iat passamos o numero correspondente da linha e coluna
df.iat[1, 0]

4